-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\crisb\OneDrive\Desktop/IDB_Data_Analyst/outputs/Stata_log
> .log
  log type:  text
 opened on:  22 Oct 2025, 01:41:56

. 
. 
. * Load dataset ----
. use "${data}/db_master_country_filter.dta", clear

. 
. 
. **Clean country-years missings values ----
. drop if isoalpha3 == "BRA" & year == 2010
(1 observation deleted)

. drop if isoalpha3 == "PRY" & year == 2019
(1 observation deleted)

. drop if isoalpha3 == "PER" & year == 2005
(1 observation deleted)

. drop if isoalpha3 == "BOL" & year == 2004
(1 observation deleted)

. drop if isoalpha3 == "BOL" & year == 2010
(1 observation deleted)

. 
. 
. 
. **Setting FE model by country -------- 
. encode isoalpha3 , gen(country_id)

. xtset country_id year

Panel variable: country_id (unbalanced)
 Time variable: year, 2003 to 2022, but with gaps
         Delta: 1 unit

. 
. 
. *Labelling---- 
. label variable hli_women_share "House Inc Women %"

. label variable investment "Investment"

. label variable gdp "GDP"

. label variable unemployment_rate "Unemp. Rate"

. label variable inflation_rate "Inflation Rate"

. label variable consumption "Consumption"

. label variable hh_female_head "HH Female Head"

. label variable poverty_rate "Poverty Rate"

. label variable working_age_share "Working Age %"

. label variable female_population_share "Female Pop %"

. label variable secondary_completion "Sec Completion"

. label variable terciary_completion "Tert Completion"

. label variable neet_rate "NEET Rate"

. label variable hh_size "HH Size"

. label variable export "Export"

. label variable gdp_grw "GDP Growth"

. label variable work_services "Work Services"

. label variable work_industry "Work Industry"

. 
. local add "addtext(Year FE, Yes, Country FE, Yes)"

. 
. 
. 
. *---- ONLY MACRO VARS-----*
. 
. ** 1. Reg solo factores macro (desempleo, gdp)
. xtreg hli_women_share unemployment_rate gdp_grw i.year, fe cluster(country_id
> )

Fixed-effects (within) regression               Number of obs     =        195
Group variable: country_id                      Number of groups  =         10

R-squared:                                      Obs per group:
     Within  = 0.5054                                         min =         18
     Between = 0.2067                                         avg =       19.5
     Overall = 0.2339                                         max =         20

                                                F(9,9)            =          .
corr(u_i, Xb) = 0.1157                          Prob > F          =          .

                            (Std. err. adjusted for 10 clusters in country_id)
------------------------------------------------------------------------------
             |               Robust
hli_women_~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
unemployme~e |   .3003895   .1823366     1.65   0.134    -.1120846    .7128637
     gdp_grw |  -.0016942   .0008909    -1.90   0.090    -.0037095    .0003212
             |
        year |
       2004  |   .0039108   .0054438     0.72   0.491    -.0084038    .0162254
       2005  |   .0101477    .007001     1.45   0.181    -.0056896     .025985
       2006  |   .0246086   .0144161     1.71   0.122    -.0080029    .0572202
       2007  |   .0212474   .0074409     2.86   0.019     .0044149    .0380798
       2008  |   .0224317    .008025     2.80   0.021     .0042778    .0405855
       2009  |   .0194591   .0087277     2.23   0.053    -.0002844    .0392026
       2010  |    .032687   .0079081     4.13   0.003     .0147977    .0505763
       2011  |    .031952    .011241     2.84   0.019     .0065231    .0573809
       2012  |   .0369236   .0098631     3.74   0.005     .0146117    .0592356
       2013  |   .0403914   .0083502     4.84   0.001     .0215019     .059281
       2014  |   .0379043   .0116651     3.25   0.010     .0115159    .0642927
       2015  |   .0334685   .0118957     2.81   0.020     .0065586    .0603785
       2016  |   .0387694   .0114237     3.39   0.008     .0129272    .0646115
       2017  |   .0443985   .0104244     4.26   0.002     .0208169      .06798
       2018  |   .0417361   .0119324     3.50   0.007     .0147431    .0687291
       2019  |   .0466333   .0119804     3.89   0.004     .0195318    .0737349
       2020  |   .0260418   .0176306     1.48   0.174    -.0138414    .0659249
       2021  |   .0560806   .0117782     4.76   0.001     .0294364    .0827248
       2022  |   .0548782   .0146893     3.74   0.005     .0216488    .0881077
             |
       _cons |   .3514109   .0203234    17.29   0.000     .3054362    .3973856
-------------+----------------------------------------------------------------
     sigma_u |  .03945385
     sigma_e |  .01763185
         rho |   .8335292   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using "${output}\tables\Results.tex", drop(i.year) tex nocons tdec(2)
>  sdec(2) rdec(2) auto(2) se `add' ctitle(Inc Women %) label replace
C:\Users\crisb\OneDrive\Desktop/IDB_Data_Analyst/outputs\tables\Results.tex
dir : seeout

. 
. 
. ** 2. Reg solo factores macro (desempleo, gdp, X)
. xtreg hli_women_share unemployment_rate gdp_grw export  i.year, fe cluster(co
> untry_id)

Fixed-effects (within) regression               Number of obs     =        195
Group variable: country_id                      Number of groups  =         10

R-squared:                                      Obs per group:
     Within  = 0.5058                                         min =         18
     Between = 0.2428                                         avg =       19.5
     Overall = 0.2482                                         max =         20

                                                F(9,9)            =          .
corr(u_i, Xb) = 0.1346                          Prob > F          =          .

                            (Std. err. adjusted for 10 clusters in country_id)
------------------------------------------------------------------------------
             |               Robust
hli_women_~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
unemployme~e |   .3057578   .1838119     1.66   0.131    -.1100536    .7215691
     gdp_grw |  -.0016654   .0008162    -2.04   0.072    -.0035118    .0001809
      export |  -.0001624   .0007717    -0.21   0.838     -.001908    .0015832
             |
        year |
       2004  |   .0040238   .0056077     0.72   0.491    -.0086618    .0167093
       2005  |   .0102118   .0071317     1.43   0.186    -.0059213    .0263449
       2006  |   .0247034   .0145661     1.70   0.124    -.0082475    .0576543
       2007  |   .0211632   .0073774     2.87   0.019     .0044742    .0378521
       2008  |   .0220445   .0079255     2.78   0.021     .0041158    .0399732
       2009  |   .0195584   .0086319     2.27   0.050     .0000317    .0390851
       2010  |   .0324421   .0080971     4.01   0.003     .0141253    .0507589
       2011  |   .0317845   .0114585     2.77   0.022     .0058636    .0577053
       2012  |   .0368055    .010058     3.66   0.005     .0140527    .0595582
       2013  |   .0401272   .0089021     4.51   0.001     .0199893    .0602651
       2014  |   .0375709   .0125105     3.00   0.015     .0092702    .0658715
       2015  |   .0330233   .0130495     2.53   0.032     .0035033    .0625432
       2016  |   .0385498   .0119868     3.22   0.011     .0114338    .0656657
       2017  |    .044158    .010995     4.02   0.003     .0192855    .0690304
       2018  |   .0414524   .0126469     3.28   0.010     .0128431    .0700617
       2019  |   .0465105   .0123875     3.75   0.005      .018488    .0745331
       2020  |    .026021   .0176518     1.47   0.175    -.0139101    .0659521
       2021  |   .0556224   .0122155     4.55   0.001     .0279889    .0832558
       2022  |   .0543811   .0157101     3.46   0.007     .0188423    .0899199
             |
       _cons |   .3508981   .0201857    17.38   0.000     .3052348    .3965614
-------------+----------------------------------------------------------------
     sigma_u |  .03910609
     sigma_e |  .01767875
         rho |  .83031059   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2  using "${output}\tables\Results.tex", drop(i.year) tex nocons tdec(2
> ) sdec(2) rdec(2) auto(2) se `add' ctitle(Inc Women %) label append
C:\Users\crisb\OneDrive\Desktop/IDB_Data_Analyst/outputs\tables\Results.tex
dir : seeout

. 
. 
. ** 3. Reg solo factores macro (desempleo, gdp, X, pobreza, inflation)
. xtreg hli_women_share unemployment_rate gdp_grw export poverty_rate inflation
> _rate i.year, fe cluster(country_id)

Fixed-effects (within) regression               Number of obs     =        195
Group variable: country_id                      Number of groups  =         10

R-squared:                                      Obs per group:
     Within  = 0.5479                                         min =         18
     Between = 0.3323                                         avg =       19.5
     Overall = 0.3411                                         max =         20

                                                F(9,9)            =          .
corr(u_i, Xb) = 0.1806                          Prob > F          =          .

                            (Std. err. adjusted for 10 clusters in country_id)
------------------------------------------------------------------------------
             |               Robust
hli_women_~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
unemployme~e |   .3572182    .155409     2.30   0.047     .0056586    .7087778
     gdp_grw |  -.0011574   .0007326    -1.58   0.149    -.0028147       .0005
      export |  -.0001371   .0007613    -0.18   0.861    -.0018594    .0015852
poverty_rate |    .090281   .1458997     0.62   0.551    -.2397671     .420329
inflation_~e |   .0009879   .0003957     2.50   0.034     .0000928     .001883
             |
        year |
       2004  |   .0069254   .0067935     1.02   0.335    -.0084427    .0222935
       2005  |   .0138015    .007997     1.73   0.118     -.004289    .0318921
       2006  |   .0286475   .0154656     1.85   0.097    -.0063381    .0636332
       2007  |   .0250203   .0079697     3.14   0.012     .0069917    .0430489
       2008  |   .0239633   .0095279     2.52   0.033     .0024096    .0455169
       2009  |    .029496   .0101208     2.91   0.017     .0066011     .052391
       2010  |   .0392901   .0092694     4.24   0.002     .0183214    .0602589
       2011  |   .0382254   .0128041     2.99   0.015     .0092605    .0671902
       2012  |   .0468539    .011761     3.98   0.003     .0202487    .0734591
       2013  |   .0499909   .0107022     4.67   0.001     .0257808     .074201
       2014  |   .0467132   .0146406     3.19   0.011     .0135938    .0798326
       2015  |   .0439796   .0147103     2.99   0.015     .0107026    .0772566
       2016  |   .0479828   .0133019     3.61   0.006     .0178917    .0780738
       2017  |   .0560482   .0127125     4.41   0.002     .0272904    .0848059
       2018  |   .0530549    .014344     3.70   0.005     .0206066    .0855033
       2019  |    .055835   .0142966     3.91   0.004     .0234939     .088176
       2020  |   .0386911   .0186948     2.07   0.068    -.0035994    .0809816
       2021  |   .0603251   .0127316     4.74   0.001     .0315242     .089126
       2022  |   .0568127   .0184014     3.09   0.013     .0151857    .0984396
             |
       _cons |   .3186852   .0286145    11.14   0.000     .2539546    .3834157
-------------+----------------------------------------------------------------
     sigma_u |  .03672077
     sigma_e |  .01701377
         rho |  .82326691   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2  using "${output}\tables\Results.tex", drop(i.year) tex nocons tdec(2
> ) sdec(2) rdec(2) auto(2) se `add' ctitle(Inc Women %) label append
C:\Users\crisb\OneDrive\Desktop/IDB_Data_Analyst/outputs\tables\Results.tex
dir : seeout

. 
. 
. ** 4. Reg solo factores macro (desempleo, gdp, X, pobreza, inflation, consumo
> , inversion)
. xtreg hli_women_share unemployment_rate gdp_grw export poverty_rate inflation
> _rate consumption investment i.year, fe cluster(country_id)

Fixed-effects (within) regression               Number of obs     =        195
Group variable: country_id                      Number of groups  =         10

R-squared:                                      Obs per group:
     Within  = 0.5595                                         min =         18
     Between = 0.0508                                         avg =       19.5
     Overall = 0.1446                                         max =         20

                                                F(9,9)            =          .
corr(u_i, Xb) = -0.2239                         Prob > F          =          .

                            (Std. err. adjusted for 10 clusters in country_id)
------------------------------------------------------------------------------
             |               Robust
hli_women_~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
unemployme~e |   .4012808   .1544472     2.60   0.029     .0518969    .7506647
     gdp_grw |  -.0013403   .0008275    -1.62   0.140    -.0032122    .0005315
      export |   .0000412   .0006473     0.06   0.951     -.001423    .0015054
poverty_rate |   .0575949   .1436962     0.40   0.698    -.2674685    .3826582
inflation_~e |   .0009916   .0004116     2.41   0.039     .0000605    .0019227
 consumption |   6.19e-11   4.01e-11     1.55   0.157    -2.87e-11    1.53e-10
  investment |   .0347772   .0857408     0.41   0.695    -.1591819    .2287363
             |
        year |
       2004  |   .0074196   .0066972     1.11   0.297    -.0077305    .0225698
       2005  |   .0139059    .007524     1.85   0.098    -.0031146    .0309263
       2006  |    .028402   .0150293     1.89   0.091    -.0055967    .0624007
       2007  |   .0245623   .0079761     3.08   0.013     .0065192    .0426054
       2008  |   .0230567   .0098303     2.35   0.044     .0008191    .0452943
       2009  |   .0275432   .0095933     2.87   0.018     .0058415    .0492448
       2010  |   .0381027   .0089406     4.26   0.002     .0178777    .0583276
       2011  |   .0361516   .0128212     2.82   0.020      .007148    .0651553
       2012  |     .04427   .0116275     3.81   0.004     .0179667    .0705733
       2013  |   .0472757   .0103134     4.58   0.001     .0239452    .0706063
       2014  |   .0433341   .0145133     2.99   0.015     .0105028    .0761654
       2015  |   .0406115   .0143646     2.83   0.020     .0081165    .0731064
       2016  |   .0440732   .0135077     3.26   0.010     .0135167    .0746297
       2017  |   .0521718   .0129632     4.02   0.003     .0228469    .0814966
       2018  |    .048571   .0151617     3.20   0.011     .0142728    .0828692
       2019  |   .0510699   .0151332     3.37   0.008     .0168363    .0853036
       2020  |   .0322834   .0210436     1.53   0.159    -.0153206    .0798873
       2021  |   .0563384   .0141964     3.97   0.003     .0242239     .088453
       2022  |   .0518385   .0194143     2.67   0.026     .0079202    .0957568
             |
       _cons |   .3117023   .0321437     9.70   0.000     .2389881    .3844165
-------------+----------------------------------------------------------------
     sigma_u |  .04313118
     sigma_e |   .0168992
         rho |  .86691585   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2  using "${output}\tables\Results.tex", drop(i.year) tex nocons tdec(2
> ) sdec(2) rdec(2) auto(2) se `add' ctitle(Inc Women %) label append
C:\Users\crisb\OneDrive\Desktop/IDB_Data_Analyst/outputs\tables\Results.tex
dir : seeout

. 
. 
. 
. *---- MORE DETERMINANTS AS COVARIETES-----*
. 
. /*
> 
> hh_size
> terciary_completion 
> working_age_share 
> neet_rate 
> work_services
> work_industry
> female_population_share 
> secondary_completion 
> hh_female_head 
> */
. 
. 
. ** 1.1 Reg (desempleo, gdp) + ( hh_size terciary_completion working_age_share
>  neet_rate work_services work_industry)
. xtreg hli_women_share unemployment_rate gdp_grw hh_size terciary_completion w
> orking_age_share neet_rate work_services work_industry i.year, fe cluster(cou
> ntry_id)

Fixed-effects (within) regression               Number of obs     =        195
Group variable: country_id                      Number of groups  =         10

R-squared:                                      Obs per group:
     Within  = 0.7120                                         min =         18
     Between = 0.0027                                         avg =       19.5
     Overall = 0.0537                                         max =         20

                                                F(9,9)            =          .
corr(u_i, Xb) = -0.4425                         Prob > F          =          .

                            (Std. err. adjusted for 10 clusters in country_id)
------------------------------------------------------------------------------
             |               Robust
hli_women_~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
unemployme~e |   .4471897   .1044472     4.28   0.002     .2109137    .6834658
     gdp_grw |  -.0009204   .0004696    -1.96   0.082    -.0019828    .0001419
     hh_size |  -.0416142   .0181171    -2.30   0.047    -.0825979   -.0006305
terciary_c~n |  -.0040313     .07183    -0.06   0.956     -.166522    .1584594
working_ag~e |  -1.215084   .2259126    -5.38   0.000    -1.726134   -.7040344
   neet_rate |  -.2044396   .0801072    -2.55   0.031    -.3856547   -.0232245
work_servi~s |    .014736   .1051594     0.14   0.892    -.2231511    .2526231
work_indus~y |  -.1431419   .2245309    -0.64   0.540    -.6510661    .3647824
             |
        year |
       2004  |    .008836   .0038326     2.31   0.047     .0001662    .0175058
       2005  |   .0145012   .0053944     2.69   0.025     .0022981    .0267043
       2006  |   .0276414   .0145271     1.90   0.089    -.0052213    .0605041
       2007  |   .0290571   .0080523     3.61   0.006     .0108415    .0472727
       2008  |   .0338352   .0089191     3.79   0.004     .0136589    .0540116
       2009  |   .0390822   .0101137     3.86   0.004     .0162033    .0619611
       2010  |   .0487066   .0116861     4.17   0.002     .0222708    .0751423
       2011  |   .0551984   .0133466     4.14   0.003     .0250063    .0853905
       2012  |   .0618097    .013134     4.71   0.001     .0320985    .0915209
       2013  |   .0657993   .0157268     4.18   0.002     .0302228    .1013758
       2014  |   .0668266   .0160012     4.18   0.002     .0306294    .1030238
       2015  |   .0631291   .0166842     3.78   0.004     .0253868    .1008714
       2016  |   .0650684   .0205668     3.16   0.011      .018543    .1115937
       2017  |   .0695057   .0196285     3.54   0.006      .025103    .1139085
       2018  |   .0652445   .0199756     3.27   0.010     .0200567    .1104324
       2019  |    .066908   .0217291     3.08   0.013     .0177533    .1160627
       2020  |    .058159   .0278679     2.09   0.067    -.0048825    .1212006
       2021  |   .0727524   .0195715     3.72   0.005     .0284786    .1170262
       2022  |   .0719046   .0213038     3.38   0.008     .0237121    .1200972
             |
       _cons |   1.299787   .1115129    11.66   0.000     1.047527    1.552047
-------------+----------------------------------------------------------------
     sigma_u |  .05167851
     sigma_e |  .01370853
         rho |  .93426002   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2  using "${output}\tables\Results_v2.tex", drop(i.year) tex nocons tde
> c(2) sdec(2) rdec(2) auto(2) se `add' ctitle(Inc Women %) label replace
C:\Users\crisb\OneDrive\Desktop/IDB_Data_Analyst/outputs\tables\Results_v2.tex
dir : seeout

. 
. 
. ** 2.1 Reg (desempleo, gdp, X) + ( hh_size terciary_completion working_age_sh
> are neet_rate work_services work_industry)
. xtreg hli_women_share unemployment_rate gdp_grw export hh_size terciary_compl
> etion working_age_share neet_rate work_services work_industry i.year, fe clus
> ter(country_id)

Fixed-effects (within) regression               Number of obs     =        195
Group variable: country_id                      Number of groups  =         10

R-squared:                                      Obs per group:
     Within  = 0.7138                                         min =         18
     Between = 0.0017                                         avg =       19.5
     Overall = 0.0593                                         max =         20

                                                F(9,9)            =          .
corr(u_i, Xb) = -0.4280                         Prob > F          =          .

                            (Std. err. adjusted for 10 clusters in country_id)
------------------------------------------------------------------------------
             |               Robust
hli_women_~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
unemployme~e |   .4625926   .1138996     4.06   0.003     .2049338    .7202514
     gdp_grw |  -.0008393   .0004464    -1.88   0.093    -.0018491    .0001705
      export |  -.0003767   .0004252    -0.89   0.399    -.0013386    .0005851
     hh_size |  -.0404702   .0177876    -2.28   0.049    -.0807086   -.0002317
terciary_c~n |   -.008109   .0721502    -0.11   0.913     -.171324     .155106
working_ag~e |   -1.21058   .2038712    -5.94   0.000    -1.671769   -.7493911
   neet_rate |   -.214535   .0859621    -2.50   0.034    -.4089948   -.0200752
work_servi~s |  -.0099478   .1031525    -0.10   0.925    -.2432949    .2233994
work_indus~y |  -.1471183   .2241355    -0.66   0.528     -.654148    .3599114
             |
        year |
       2004  |   .0090401   .0037314     2.42   0.038     .0005991    .0174812
       2005  |   .0145841   .0052676     2.77   0.022     .0026679    .0265002
       2006  |   .0279133   .0144358     1.93   0.085    -.0047427    .0605693
       2007  |   .0289613   .0074705     3.88   0.004      .012062    .0458607
       2008  |    .033113   .0081363     4.07   0.003     .0147075    .0515185
       2009  |   .0395534   .0096407     4.10   0.003     .0177447     .061362
       2010  |   .0483574   .0107384     4.50   0.001     .0240654    .0726494
       2011  |    .055117   .0121571     4.53   0.001     .0276157    .0826182
       2012  |   .0619707   .0120776     5.13   0.001     .0346494    .0892921
       2013  |   .0656116   .0145715     4.50   0.001     .0326486    .0985746
       2014  |   .0666763   .0147941     4.51   0.001     .0332097    .1001429
       2015  |   .0628882   .0155523     4.04   0.003     .0277065    .0980698
       2016  |   .0652854    .019398     3.37   0.008      .021404    .1091668
       2017  |   .0697472   .0183889     3.79   0.004     .0281486    .1113458
       2018  |   .0653891   .0187037     3.50   0.007     .0230784    .1076998
       2019  |   .0673764    .020671     3.26   0.010     .0206154    .1141373
       2020  |   .0592363   .0270569     2.19   0.056    -.0019707    .1204433
       2021  |   .0725644   .0183223     3.96   0.003     .0311165    .1140124
       2022  |   .0716881   .0198369     3.61   0.006     .0268138    .1165623
             |
       _cons |   1.300056   .1028279    12.64   0.000     1.067443    1.532669
-------------+----------------------------------------------------------------
     sigma_u |   .0511648
     sigma_e |  .01370765
         rho |  .93303022   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2  using "${output}\tables\Results_v2.tex", drop(i.year) tex nocons tde
> c(2) sdec(2) rdec(2) auto(2) se `add' ctitle(Inc Women %) label append
C:\Users\crisb\OneDrive\Desktop/IDB_Data_Analyst/outputs\tables\Results_v2.tex
dir : seeout

. 
. 
. ** 3.1 Reg (desempleo, gdp, X, pobreza, inflation) + ( hh_size terciary_compl
> etion working_age_share neet_rate work_services work_industry)
. xtreg hli_women_share unemployment_rate gdp_grw export poverty_rate inflation
> _rate hh_size terciary_completion working_age_share neet_rate work_services w
> ork_industry i.year, fe cluster(country_id)

Fixed-effects (within) regression               Number of obs     =        195
Group variable: country_id                      Number of groups  =         10

R-squared:                                      Obs per group:
     Within  = 0.7288                                         min =         18
     Between = 0.0127                                         avg =       19.5
     Overall = 0.1269                                         max =         20

                                                F(9,9)            =          .
corr(u_i, Xb) = -0.3338                         Prob > F          =          .

                            (Std. err. adjusted for 10 clusters in country_id)
------------------------------------------------------------------------------
             |               Robust
hli_women_~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
unemployme~e |   .4454329   .0834474     5.34   0.000     .2566617    .6342041
     gdp_grw |  -.0007108   .0004611    -1.54   0.158    -.0017538    .0003323
      export |  -.0002577   .0003425    -0.75   0.471    -.0010324     .000517
poverty_rate |   .0821696   .0934442     0.88   0.402    -.1292159    .2935552
inflation_~e |   .0006594   .0001987     3.32   0.009       .00021    .0011089
     hh_size |  -.0447176   .0137208    -3.26   0.010    -.0757563   -.0136789
terciary_c~n |   .0294913   .0539203     0.55   0.598    -.0924849    .1514675
working_ag~e |  -1.136011   .1873421    -6.06   0.000    -1.559809   -.7122142
   neet_rate |  -.1881013   .0679814    -2.77   0.022    -.3418859   -.0343167
work_servi~s |  -.0204056   .0996031    -0.20   0.842    -.2457236    .2049123
work_indus~y |  -.1081114   .2201152    -0.49   0.635    -.6060465    .3898237
             |
        year |
       2004  |   .0102444   .0045865     2.23   0.052    -.0001309    .0206197
       2005  |   .0157956   .0058429     2.70   0.024     .0025782    .0290131
       2006  |   .0283829   .0151883     1.87   0.094    -.0059755    .0627412
       2007  |   .0284987   .0059599     4.78   0.001     .0150166    .0419809
       2008  |   .0310557   .0074513     4.17   0.002     .0141998    .0479116
       2009  |   .0413878   .0079271     5.22   0.001     .0234555    .0593201
       2010  |   .0486638   .0075477     6.45   0.000     .0315897    .0657379
       2011  |   .0542085   .0102823     5.27   0.001     .0309482    .0774687
       2012  |   .0628174   .0105566     5.95   0.000     .0389366    .0866982
       2013  |   .0662039   .0123011     5.38   0.000     .0383769     .094031
       2014  |   .0661899   .0118001     5.61   0.000     .0394961    .0928837
       2015  |   .0633528   .0119709     5.29   0.000     .0362727    .0904328
       2016  |   .0646921   .0145154     4.46   0.002     .0318561    .0975282
       2017  |    .070848   .0146443     4.84   0.001     .0377203    .1039756
       2018  |   .0659929   .0149991     4.40   0.002     .0320626    .0999233
       2019  |   .0662793   .0161664     4.10   0.003     .0297084    .1028501
       2020  |   .0575868   .0194999     2.95   0.016     .0134749    .1016986
       2021  |   .0694099   .0134663     5.15   0.001      .038947    .0998729
       2022  |   .0654442   .0151618     4.32   0.002     .0311458    .0997426
             |
       _cons |   1.238829   .0945925    13.10   0.000     1.024846    1.452812
-------------+----------------------------------------------------------------
     sigma_u |  .04716122
     sigma_e |  .01342889
         rho |   .9250015   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2  using "${output}\tables\Results_v2.tex", drop(i.year) tex nocons tde
> c(2) sdec(2) rdec(2) auto(2) se `add' ctitle(Inc Women %) label append
C:\Users\crisb\OneDrive\Desktop/IDB_Data_Analyst/outputs\tables\Results_v2.tex
dir : seeout

. 
. 
. ** 4.1 Reg (desempleo, gdp, X, pobreza, inflation, consumo, inversion) + ( hh
> _size terciary_completion working_age_share neet_rate work_services work_indu
> stry)
. xtreg hli_women_share unemployment_rate gdp_grw export poverty_rate inflation
> _rate consumption investment hh_size terciary_completion working_age_share ne
> et_rate work_services work_industry i.year, fe cluster(country_id)

Fixed-effects (within) regression               Number of obs     =        195
Group variable: country_id                      Number of groups  =         10

R-squared:                                      Obs per group:
     Within  = 0.7311                                         min =         18
     Between = 0.0014                                         avg =       19.5
     Overall = 0.0877                                         max =         20

                                                F(9,9)            =          .
corr(u_i, Xb) = -0.3999                         Prob > F          =          .

                            (Std. err. adjusted for 10 clusters in country_id)
------------------------------------------------------------------------------
             |               Robust
hli_women_~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
unemployme~e |   .4807877   .0897974     5.35   0.000     .2776519    .6839235
     gdp_grw |  -.0007377   .0004872    -1.51   0.164    -.0018399    .0003645
      export |  -.0002332   .0004199    -0.56   0.592     -.001183    .0007166
poverty_rate |   .0620714   .0846747     0.73   0.482     -.129476    .2536188
inflation_~e |   .0006063    .000192     3.16   0.012     .0001719    .0010406
 consumption |   3.35e-11   3.56e-11     0.94   0.370    -4.69e-11    1.14e-10
  investment |   .0057487   .0843965     0.07   0.947    -.1851695     .196667
     hh_size |  -.0412792   .0166131    -2.48   0.035    -.0788606   -.0036978
terciary_c~n |  -.0006319   .0680507    -0.01   0.993    -.1545731    .1533094
working_ag~e |  -1.138649   .1638408    -6.95   0.000    -1.509283   -.7680154
   neet_rate |  -.1787421   .0740141    -2.41   0.039    -.3461737   -.0113105
work_servi~s |   .0010557   .1102807     0.01   0.993    -.2484165    .2505279
work_indus~y |  -.1222248   .2183861    -0.56   0.589    -.6162486     .371799
             |
        year |
       2004  |   .0106928   .0047373     2.26   0.050    -.0000238    .0214093
       2005  |   .0165386   .0058082     2.85   0.019     .0033996    .0296775
       2006  |   .0297465   .0158036     1.88   0.092    -.0060037    .0654967
       2007  |   .0303885   .0063674     4.77   0.001     .0159844    .0447927
       2008  |    .033189   .0079101     4.20   0.002     .0152951     .051083
       2009  |   .0430409   .0088168     4.88   0.001     .0230958    .0629859
       2010  |   .0509759   .0081927     6.22   0.000     .0324428     .069509
       2011  |    .056603   .0102048     5.55   0.000      .033518     .079688
       2012  |   .0651263    .011553     5.64   0.000     .0389915    .0912611
       2013  |   .0686589   .0130951     5.24   0.001     .0390357    .0982822
       2014  |   .0685027   .0120756     5.67   0.000     .0411858    .0958196
       2015  |   .0653396   .0125397     5.21   0.001     .0369727    .0937065
       2016  |   .0668271   .0149756     4.46   0.002       .03295    .1007042
       2017  |   .0728643   .0154972     4.70   0.001     .0378071    .1079215
       2018  |   .0680969   .0154139     4.42   0.002     .0332284    .1029655
       2019  |   .0686702   .0171133     4.01   0.003     .0299573    .1073831
       2020  |    .059803   .0210176     2.85   0.019     .0122578    .1073482
       2021  |   .0717559   .0153232     4.68   0.001     .0370925    .1064193
       2022  |   .0685828   .0169145     4.05   0.003     .0303195    .1068462
             |
       _cons |   1.223163   .0912473    13.40   0.000     1.016747    1.429579
-------------+----------------------------------------------------------------
     sigma_u |  .04957535
     sigma_e |  .01346116
         rho |  .93133442   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2  using "${output}\tables\Results_v2.tex", drop(i.year) tex nocons tde
> c(2) sdec(2) rdec(2) auto(2) se `add' ctitle(Inc Women %) label append
C:\Users\crisb\OneDrive\Desktop/IDB_Data_Analyst/outputs\tables\Results_v2.tex
dir : seeout

. 
. 
. 
. capture log close
